rgv = '[АВЕКМНОРСТУХABEKMHOPCTYX]{1}[0-9]{3}(?<!000)[АВЕКМНОРСТУХABEKMHOPCTYX]{2}[0-9]{2,3}$'
# rgv - регулярное выражение для проверки госномера

i = ["0", "A123AA11", "А222АА123", "A12AA123", "A124CC1234", "AA123A12", "В000УУ17", "В001УУ17"]
# i - список номеров для проверки
vn = 0 # число верных номеров
nn = 0 # число неверных номеров
for i in i:
        import re
        if re.match(rgv, i):
            print("верен   -",i)
            vn = vn +1
        else:
            print("неверен -",i)
            nn += 1
print ("\nВсего верных номеров",vn)
print ("Всего неверных номеров",nn)
print ("\nВсего номеров",vn + nn,"\n")
